docs/load-test/20260130-090818-caffeine.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: infra/k6/scripts/allocation-status-load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 1000 max VUs, 2m30s max duration (incl. graceful stop):
              * load_test: Up to 1000 looping VUs for 2m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m00.9s), 0031/1000 VUs, 0 complete and 0 interrupted iterations
load_test   [   1% ] 0031/1000 VUs  0m00.9s/2m00.0s

running (0m01.9s), 0064/1000 VUs, 30 complete and 0 interrupted iterations
load_test   [   2% ] 0064/1000 VUs  0m01.9s/2m00.0s

running (0m02.9s), 0097/1000 VUs, 93 complete and 0 interrupted iterations
load_test   [   2% ] 0097/1000 VUs  0m02.9s/2m00.0s

running (0m03.9s), 0131/1000 VUs, 189 complete and 0 interrupted iterations
load_test   [   3% ] 0131/1000 VUs  0m03.9s/2m00.0s

running (0m04.9s), 0164/1000 VUs, 316 complete and 0 interrupted iterations
load_test   [   4% ] 0164/1000 VUs  0m04.9s/2m00.0s

running (0m05.9s), 0197/1000 VUs, 475 complete and 0 interrupted iterations
load_test   [   5% ] 0197/1000 VUs  0m05.9s/2m00.0s

running (0m06.9s), 0231/1000 VUs, 670 complete and 0 interrupted iterations
load_test   [   6% ] 0231/1000 VUs  0m06.9s/2m00.0s

running (0m07.9s), 0264/1000 VUs, 889 complete and 0 interrupted iterations
load_test   [   7% ] 0264/1000 VUs  0m07.9s/2m00.0s

running (0m08.9s), 0297/1000 VUs, 1150 complete and 0 interrupted iterations
load_test   [   7% ] 0297/1000 VUs  0m08.9s/2m00.0s

running (0m09.9s), 0331/1000 VUs, 1447 complete and 0 interrupted iterations
load_test   [   8% ] 0331/1000 VUs  0m09.9s/2m00.0s

running (0m10.9s), 0364/1000 VUs, 1767 complete and 0 interrupted iterations
load_test   [   9% ] 0364/1000 VUs  0m10.9s/2m00.0s

running (0m11.9s), 0397/1000 VUs, 2126 complete and 0 interrupted iterations
load_test   [  10% ] 0397/1000 VUs  0m11.9s/2m00.0s

running (0m12.9s), 0431/1000 VUs, 2517 complete and 0 interrupted iterations
load_test   [  11% ] 0431/1000 VUs  0m12.9s/2m00.0s

running (0m13.9s), 0464/1000 VUs, 2936 complete and 0 interrupted iterations
load_test   [  12% ] 0464/1000 VUs  0m13.9s/2m00.0s

running (0m14.9s), 0497/1000 VUs, 3397 complete and 0 interrupted iterations
load_test   [  12% ] 0497/1000 VUs  0m14.9s/2m00.0s

running (0m15.9s), 0531/1000 VUs, 3874 complete and 0 interrupted iterations
load_test   [  13% ] 0531/1000 VUs  0m15.9s/2m00.0s

running (0m16.9s), 0564/1000 VUs, 4391 complete and 0 interrupted iterations
load_test   [  14% ] 0564/1000 VUs  0m16.9s/2m00.0s

running (0m17.9s), 0597/1000 VUs, 4945 complete and 0 interrupted iterations
load_test   [  15% ] 0597/1000 VUs  0m17.9s/2m00.0s

running (0m18.9s), 0631/1000 VUs, 5530 complete and 0 interrupted iterations
load_test   [  16% ] 0631/1000 VUs  0m18.9s/2m00.0s

running (0m19.9s), 0664/1000 VUs, 6151 complete and 0 interrupted iterations
load_test   [  17% ] 0664/1000 VUs  0m19.9s/2m00.0s

running (0m20.9s), 0697/1000 VUs, 6784 complete and 0 interrupted iterations
load_test   [  17% ] 0697/1000 VUs  0m20.9s/2m00.0s

running (0m21.9s), 0731/1000 VUs, 7454 complete and 0 interrupted iterations
load_test   [  18% ] 0731/1000 VUs  0m21.9s/2m00.0s

running (0m22.9s), 0764/1000 VUs, 8144 complete and 0 interrupted iterations
load_test   [  19% ] 0764/1000 VUs  0m22.9s/2m00.0s

running (0m23.9s), 0797/1000 VUs, 8888 complete and 0 interrupted iterations
load_test   [  20% ] 0797/1000 VUs  0m23.9s/2m00.0s

running (0m24.9s), 0831/1000 VUs, 9665 complete and 0 interrupted iterations
load_test   [  21% ] 0831/1000 VUs  0m24.9s/2m00.0s

running (0m25.9s), 0864/1000 VUs, 10378 complete and 0 interrupted iterations
load_test   [  22% ] 0864/1000 VUs  0m25.9s/2m00.0s

running (0m26.9s), 0897/1000 VUs, 11198 complete and 0 interrupted iterations
load_test   [  22% ] 0897/1000 VUs  0m26.9s/2m00.0s

running (0m27.9s), 0931/1000 VUs, 11896 complete and 0 interrupted iterations
load_test   [  23% ] 0931/1000 VUs  0m27.9s/2m00.0s

running (0m28.9s), 0964/1000 VUs, 12783 complete and 0 interrupted iterations
load_test   [  24% ] 0964/1000 VUs  0m28.9s/2m00.0s

running (0m29.9s), 0997/1000 VUs, 13395 complete and 0 interrupted iterations
load_test   [  25% ] 0997/1000 VUs  0m29.9s/2m00.0s

running (0m30.9s), 1000/1000 VUs, 14355 complete and 0 interrupted iterations
load_test   [  26% ] 1000/1000 VUs  0m30.9s/2m00.0s

running (0m31.9s), 1000/1000 VUs, 14942 complete and 0 interrupted iterations
load_test   [  27% ] 1000/1000 VUs  0m31.9s/2m00.0s

running (0m32.9s), 1000/1000 VUs, 15894 complete and 0 interrupted iterations
load_test   [  27% ] 1000/1000 VUs  0m32.9s/2m00.0s

running (0m33.9s), 1000/1000 VUs, 16195 complete and 0 interrupted iterations
load_test   [  28% ] 1000/1000 VUs  0m33.9s/2m00.0s

running (0m34.9s), 1000/1000 VUs, 16195 complete and 0 interrupted iterations
load_test   [  29% ] 1000/1000 VUs  0m34.9s/2m00.0s

running (0m35.9s), 1000/1000 VUs, 16195 complete and 0 interrupted iterations
load_test   [  30% ] 1000/1000 VUs  0m35.9s/2m00.0s

running (0m36.9s), 1000/1000 VUs, 16195 complete and 0 interrupted iterations
load_test   [  31% ] 1000/1000 VUs  0m36.9s/2m00.0s

running (0m37.9s), 1000/1000 VUs, 16195 complete and 0 interrupted iterations
load_test   [  32% ] 1000/1000 VUs  0m37.9s/2m00.0s

running (0m38.9s), 1000/1000 VUs, 16195 complete and 0 interrupted iterations
load_test   [  32% ] 1000/1000 VUs  0m38.9s/2m00.0s

running (0m39.9s), 1000/1000 VUs, 16197 complete and 0 interrupted iterations
load_test   [  33% ] 1000/1000 VUs  0m39.9s/2m00.0s

running (0m40.9s), 1000/1000 VUs, 16203 complete and 0 interrupted iterations
load_test   [  34% ] 1000/1000 VUs  0m40.9s/2m00.0s

running (0m41.9s), 1000/1000 VUs, 16209 complete and 0 interrupted iterations
load_test   [  35% ] 1000/1000 VUs  0m41.9s/2m00.0s

running (0m42.9s), 1000/1000 VUs, 16285 complete and 0 interrupted iterations
load_test   [  36% ] 1000/1000 VUs  0m42.9s/2m00.0s

running (0m43.9s), 1000/1000 VUs, 16581 complete and 0 interrupted iterations
load_test   [  37% ] 1000/1000 VUs  0m43.9s/2m00.0s

running (0m44.9s), 1000/1000 VUs, 17410 complete and 0 interrupted iterations
load_test   [  37% ] 1000/1000 VUs  0m44.9s/2m00.0s

running (0m45.9s), 1000/1000 VUs, 17955 complete and 0 interrupted iterations
load_test   [  38% ] 1000/1000 VUs  0m45.9s/2m00.0s

running (0m46.9s), 1000/1000 VUs, 18801 complete and 0 interrupted iterations
load_test   [  39% ] 1000/1000 VUs  0m46.9s/2m00.0s

running (0m47.9s), 1000/1000 VUs, 19523 complete and 0 interrupted iterations
load_test   [  40% ] 1000/1000 VUs  0m47.9s/2m00.0s

running (0m48.9s), 1000/1000 VUs, 20362 complete and 0 interrupted iterations
load_test   [  41% ] 1000/1000 VUs  0m48.9s/2m00.0s

running (0m49.9s), 1000/1000 VUs, 21037 complete and 0 interrupted iterations
load_test   [  42% ] 1000/1000 VUs  0m49.9s/2m00.0s

running (0m50.9s), 1000/1000 VUs, 21880 complete and 0 interrupted iterations
load_test   [  42% ] 1000/1000 VUs  0m50.9s/2m00.0s

running (0m51.9s), 1000/1000 VUs, 22423 complete and 0 interrupted iterations
load_test   [  43% ] 1000/1000 VUs  0m51.9s/2m00.0s

running (0m52.9s), 1000/1000 VUs, 23315 complete and 0 interrupted iterations
load_test   [  44% ] 1000/1000 VUs  0m52.9s/2m00.0s

running (0m53.9s), 1000/1000 VUs, 23905 complete and 0 interrupted iterations
load_test   [  45% ] 1000/1000 VUs  0m53.9s/2m00.0s

running (0m54.9s), 1000/1000 VUs, 24815 complete and 0 interrupted iterations
load_test   [  46% ] 1000/1000 VUs  0m54.9s/2m00.0s

running (0m55.9s), 1000/1000 VUs, 25441 complete and 0 interrupted iterations
load_test   [  47% ] 1000/1000 VUs  0m55.9s/2m00.0s

running (0m56.9s), 1000/1000 VUs, 26366 complete and 0 interrupted iterations
load_test   [  47% ] 1000/1000 VUs  0m56.9s/2m00.0s

running (0m57.9s), 1000/1000 VUs, 27009 complete and 0 interrupted iterations
load_test   [  48% ] 1000/1000 VUs  0m57.9s/2m00.0s

running (0m58.9s), 1000/1000 VUs, 27894 complete and 0 interrupted iterations
load_test   [  49% ] 1000/1000 VUs  0m58.9s/2m00.0s

running (0m59.9s), 1000/1000 VUs, 28611 complete and 0 interrupted iterations
load_test   [  50% ] 1000/1000 VUs  0m59.9s/2m00.0s
time="2026-01-30T09:16:07+09:00" level=warning msg="Request Failed" error="read tcp 172.16.11.200:13013->3.38.125.37:80: wsarecv: An existing connection was forcibly closed by the remote host."
time="2026-01-30T09:16:07+09:00" level=warning msg="Request Failed" error="read tcp 172.16.11.200:12023->3.38.125.37:80: wsarecv: An existing connection was forcibly closed by the remote host."
time="2026-01-30T09:16:07+09:00" level=warning msg="Request Failed" error="read tcp 172.16.11.200:12301->3.38.125.37:80: wsarecv: An existing connection was forcibly closed by the remote host."
time="2026-01-30T09:16:07+09:00" level=warning msg="Request Failed" error="read tcp 172.16.11.200:12358->3.38.125.37:80: wsarecv: An existing connection was forcibly closed by the remote host."
time="2026-01-30T09:16:07+09:00" level=warning msg="Request Failed" error="read tcp 172.16.11.200:12255->3.38.125.37:80: wsarecv: An existing connection was forcibly closed by the remote host."
time="2026-01-30T09:16:07+09:00" level=warning msg="Request Failed" error="read tcp 172.16.11.200:12957->3.38.125.37:80: wsarecv: An existing connection was forcibly closed by the remote host."
time="2026-01-30T09:16:07+09:00" level=warning msg="Request Failed" error="read tcp 172.16.11.200:13020->3.38.125.37:80: wsarecv: An existing connection was forcibly closed by the remote host."
time="2026-01-30T09:16:07+09:00" level=warning msg="Request Failed" error="read tcp 172.16.11.200:12390->3.38.125.37:80: wsarecv: An existing connection was forcibly closed by the remote host."

running (1m00.9s), 1000/1000 VUs, 29303 complete and 0 interrupted iterations
load_test   [  51% ] 1000/1000 VUs  1m00.9s/2m00.0s
time="2026-01-30T09:16:08+09:00" level=warning msg="Request Failed" error="read tcp 172.16.11.200:11963->3.38.125.37:80: wsarecv: An existing connection was forcibly closed by the remote host."

running (1m01.9s), 1000/1000 VUs, 30198 complete and 0 interrupted iterations
load_test   [  52% ] 1000/1000 VUs  1m01.9s/2m00.0s
time="2026-01-30T09:16:09+09:00" level=warning msg="Request Failed" error="read tcp 172.16.11.200:12838->3.38.125.37:80: wsarecv: An existing connection was forcibly closed by the remote host."
time="2026-01-30T09:16:09+09:00" level=warning msg="Request Failed" error="read tcp 172.16.11.200:12934->3.38.125.37:80: wsarecv: An existing connection was forcibly closed by the remote host."
time="2026-01-30T09:16:09+09:00" level=warning msg="Request Failed" error="read tcp 172.16.11.200:12988->3.38.125.37:80: wsarecv: An existing connection was forcibly closed by the remote host."
time="2026-01-30T09:16:09+09:00" level=warning msg="Request Failed" error="read tcp 172.16.11.200:12003->3.38.125.37:80: wsarecv: An existing connection was forcibly closed by the remote host."
time="2026-01-30T09:16:09+09:00" level=warning msg="Request Failed" error="read tcp 172.16.11.200:11987->3.38.125.37:80: wsarecv: An existing connection was forcibly closed by the remote host."
time="2026-01-30T09:16:09+09:00" level=warning msg="Request Failed" error="read tcp 172.16.11.200:13103->3.38.125.37:80: wsarecv: An existing connection was forcibly closed by the remote host."
time="2026-01-30T09:16:09+09:00" level=warning msg="Request Failed" error="read tcp 172.16.11.200:12308->3.38.125.37:80: wsarecv: An existing connection was forcibly closed by the remote host."
time="2026-01-30T09:16:09+09:00" level=warning msg="Request Failed" error="read tcp 172.16.11.200:12887->3.38.125.37:80: wsarecv: An existing connection was forcibly closed by the remote host."
time="2026-01-30T09:16:09+09:00" level=warning msg="Request Failed" error="read tcp 172.16.11.200:13105->3.38.125.37:80: wsarecv: An existing connection was forcibly closed by the remote host."
time="2026-01-30T09:16:09+09:00" level=warning msg="Request Failed" error="read tcp 172.16.11.200:12841->3.38.125.37:80: wsarecv: An existing connection was forcibly closed by the remote host."
time="2026-01-30T09:16:09+09:00" level=warning msg="Request Failed" error="read tcp 172.16.11.200:12047->3.38.125.37:80: wsarecv: An existing connection was forcibly closed by the remote host."
time="2026-01-30T09:16:09+09:00" level=warning msg="Request Failed" error="read tcp 172.16.11.200:12065->3.38.125.37:80: wsarecv: An existing connection was forcibly closed by the remote host."
time="2026-01-30T09:16:09+09:00" level=warning msg="Request Failed" error="read tcp 172.16.11.200:13003->3.38.125.37:80: wsarecv: An existing connection was forcibly closed by the remote host."
time="2026-01-30T09:16:09+09:00" level=warning msg="Request Failed" error="read tcp 172.16.11.200:11943->3.38.125.37:80: wsarecv: An existing connection was forcibly closed by the remote host."
time="2026-01-30T09:16:09+09:00" level=warning msg="Request Failed" error="read tcp 172.16.11.200:11909->3.38.125.37:80: wsarecv: An existing connection was forcibly closed by the remote host."
time="2026-01-30T09:16:09+09:00" level=warning msg="Request Failed" error="read tcp 172.16.11.200:12601->3.38.125.37:80: wsarecv: An existing connection was forcibly closed by the remote host."
time="2026-01-30T09:16:09+09:00" level=warning msg="Request Failed" error="read tcp 172.16.11.200:12066->3.38.125.37:80: wsarecv: An existing connection was forcibly closed by the remote host."
time="2026-01-30T09:16:09+09:00" level=warning msg="Request Failed" error="read tcp 172.16.11.200:12577->3.38.125.37:80: wsarecv: An existing connection was forcibly closed by the remote host."
time="2026-01-30T09:16:09+09:00" level=warning msg="Request Failed" error="read tcp 172.16.11.200:11900->3.38.125.37:80: wsarecv: An existing connection was forcibly closed by the remote host."
time="2026-01-30T09:16:09+09:00" level=warning msg="Request Failed" error="read tcp 172.16.11.200:12929->3.38.125.37:80: wsarecv: An existing connection was forcibly closed by the remote host."
time="2026-01-30T09:16:09+09:00" level=warning msg="Request Failed" error="read tcp 172.16.11.200:12348->3.38.125.37:80: wsarecv: An existing connection was forcibly closed by the remote host."
time="2026-01-30T09:16:09+09:00" level=warning msg="Request Failed" error="read tcp 172.16.11.200:12441->3.38.125.37:80: wsarecv: An existing connection was forcibly closed by the remote host."
time="2026-01-30T09:16:09+09:00" level=warning msg="Request Failed" error="read tcp 172.16.11.200:12320->3.38.125.37:80: wsarecv: An existing connection was forcibly closed by the remote host."
time="2026-01-30T09:16:09+09:00" level=warning msg="Request Failed" error="read tcp 172.16.11.200:12628->3.38.125.37:80: wsarecv: An existing connection was forcibly closed by the remote host."

running (1m02.9s), 1000/1000 VUs, 30798 complete and 0 interrupted iterations
load_test   [  52% ] 1000/1000 VUs  1m02.9s/2m00.0s

running (1m03.9s), 1000/1000 VUs, 31734 complete and 0 interrupted iterations
load_test   [  53% ] 1000/1000 VUs  1m03.9s/2m00.0s

running (1m04.9s), 1000/1000 VUs, 32331 complete and 0 interrupted iterations
load_test   [  54% ] 1000/1000 VUs  1m04.9s/2m00.0s

running (1m05.9s), 1000/1000 VUs, 33260 complete and 0 interrupted iterations
load_test   [  55% ] 1000/1000 VUs  1m05.9s/2m00.0s

running (1m06.9s), 1000/1000 VUs, 33858 complete and 0 interrupted iterations
load_test   [  56% ] 1000/1000 VUs  1m06.9s/2m00.0s

running (1m07.9s), 1000/1000 VUs, 34809 complete and 0 interrupted iterations
load_test   [  57% ] 1000/1000 VUs  1m07.9s/2m00.0s

running (1m08.9s), 1000/1000 VUs, 35405 complete and 0 interrupted iterations
load_test   [  57% ] 1000/1000 VUs  1m08.9s/2m00.0s

running (1m09.9s), 1000/1000 VUs, 36348 complete and 0 interrupted iterations
load_test   [  58% ] 1000/1000 VUs  1m09.9s/2m00.0s

running (1m10.9s), 1000/1000 VUs, 36965 complete and 0 interrupted iterations
load_test   [  59% ] 1000/1000 VUs  1m10.9s/2m00.0s

running (1m11.9s), 1000/1000 VUs, 37859 complete and 0 interrupted iterations
load_test   [  60% ] 1000/1000 VUs  1m11.9s/2m00.0s

running (1m12.9s), 1000/1000 VUs, 38569 complete and 0 interrupted iterations
load_test   [  61% ] 1000/1000 VUs  1m12.9s/2m00.0s

running (1m13.9s), 1000/1000 VUs, 39212 complete and 0 interrupted iterations
load_test   [  62% ] 1000/1000 VUs  1m13.9s/2m00.0s

running (1m14.9s), 1000/1000 VUs, 40153 complete and 0 interrupted iterations
load_test   [  62% ] 1000/1000 VUs  1m14.9s/2m00.0s

running (1m15.9s), 1000/1000 VUs, 40737 complete and 0 interrupted iterations
load_test   [  63% ] 1000/1000 VUs  1m15.9s/2m00.0s
time="2026-01-30T09:16:23+09:00" level=warning msg="Request Failed" error="read tcp 172.16.11.200:12211->3.38.125.37:80: wsarecv: An existing connection was forcibly closed by the remote host."
time="2026-01-30T09:16:23+09:00" level=warning msg="Request Failed" error="read tcp 172.16.11.200:12220->3.38.125.37:80: wsarecv: An existing connection was forcibly closed by the remote host."

running (1m16.9s), 1000/1000 VUs, 41680 complete and 0 interrupted iterations
load_test   [  64% ] 1000/1000 VUs  1m16.9s/2m00.0s

running (1m17.9s), 1000/1000 VUs, 42268 complete and 0 interrupted iterations
load_test   [  65% ] 1000/1000 VUs  1m17.9s/2m00.0s

running (1m18.9s), 1000/1000 VUs, 43207 complete and 0 interrupted iterations
load_test   [  66% ] 1000/1000 VUs  1m18.9s/2m00.0s

running (1m19.9s), 1000/1000 VUs, 43786 complete and 0 interrupted iterations
load_test   [  67% ] 1000/1000 VUs  1m19.9s/2m00.0s

running (1m20.9s), 1000/1000 VUs, 44737 complete and 0 interrupted iterations
load_test   [  67% ] 1000/1000 VUs  1m20.9s/2m00.0s

running (1m21.9s), 1000/1000 VUs, 45333 complete and 0 interrupted iterations
load_test   [  68% ] 1000/1000 VUs  1m21.9s/2m00.0s

running (1m22.9s), 1000/1000 VUs, 46261 complete and 0 interrupted iterations
load_test   [  69% ] 1000/1000 VUs  1m22.9s/2m00.0s

running (1m23.9s), 1000/1000 VUs, 46904 complete and 0 interrupted iterations
load_test   [  70% ] 1000/1000 VUs  1m23.9s/2m00.0s

running (1m24.9s), 1000/1000 VUs, 47712 complete and 0 interrupted iterations
load_test   [  71% ] 1000/1000 VUs  1m24.9s/2m00.0s

running (1m25.9s), 1000/1000 VUs, 48483 complete and 0 interrupted iterations
load_test   [  72% ] 1000/1000 VUs  1m25.9s/2m00.0s

running (1m26.9s), 1000/1000 VUs, 49015 complete and 0 interrupted iterations
load_test   [  72% ] 1000/1000 VUs  1m26.9s/2m00.0s

running (1m27.9s), 1000/1000 VUs, 49871 complete and 0 interrupted iterations
load_test   [  73% ] 1000/1000 VUs  1m27.9s/2m00.0s

running (1m28.9s), 1000/1000 VUs, 50324 complete and 0 interrupted iterations
load_test   [  74% ] 1000/1000 VUs  1m28.9s/2m00.0s

running (1m29.9s), 1000/1000 VUs, 51181 complete and 0 interrupted iterations
load_test   [  75% ] 1000/1000 VUs  1m29.9s/2m00.0s
time="2026-01-30T09:16:37+09:00" level=warning msg="Request Failed" error="request timeout"

running (1m30.9s), 0988/1000 VUs, 51871 complete and 0 interrupted iterations
load_test   [  76% ] 0988/1000 VUs  1m30.9s/2m00.0s

running (1m31.9s), 0957/1000 VUs, 52676 complete and 0 interrupted iterations
load_test   [  77% ] 0957/1000 VUs  1m31.9s/2m00.0s
time="2026-01-30T09:16:39+09:00" level=warning msg="Request Failed" error="request timeout"

running (1m32.9s), 0930/1000 VUs, 53397 complete and 0 interrupted iterations
load_test   [  77% ] 0930/1000 VUs  1m32.9s/2m00.0s

running (1m33.9s), 0887/1000 VUs, 54237 complete and 0 interrupted iterations
load_test   [  78% ] 0887/1000 VUs  1m33.9s/2m00.0s

running (1m34.9s), 0865/1000 VUs, 54817 complete and 0 interrupted iterations
load_test   [  79% ] 0865/1000 VUs  1m34.9s/2m00.0s

running (1m35.9s), 0818/1000 VUs, 55647 complete and 0 interrupted iterations
load_test   [  80% ] 0818/1000 VUs  1m35.9s/2m00.0s

running (1m36.9s), 0792/1000 VUs, 56242 complete and 0 interrupted iterations
load_test   [  81% ] 0792/1000 VUs  1m36.9s/2m00.0s

running (1m37.9s), 0757/1000 VUs, 57027 complete and 0 interrupted iterations
load_test   [  82% ] 0757/1000 VUs  1m37.9s/2m00.0s

running (1m38.9s), 0717/1000 VUs, 57704 complete and 0 interrupted iterations
load_test   [  82% ] 0717/1000 VUs  1m38.9s/2m00.0s

running (1m39.9s), 0692/1000 VUs, 58259 complete and 0 interrupted iterations
load_test   [  83% ] 0692/1000 VUs  1m39.9s/2m00.0s

running (1m40.9s), 0656/1000 VUs, 58940 complete and 0 interrupted iterations
load_test   [  84% ] 0656/1000 VUs  1m40.9s/2m00.0s

running (1m41.9s), 0622/1000 VUs, 59594 complete and 0 interrupted iterations
load_test   [  85% ] 0622/1000 VUs  1m41.9s/2m00.0s

running (1m42.9s), 0583/1000 VUs, 60211 complete and 0 interrupted iterations
load_test   [  86% ] 0583/1000 VUs  1m42.9s/2m00.0s

running (1m43.9s), 0553/1000 VUs, 60782 complete and 0 interrupted iterations
load_test   [  87% ] 0553/1000 VUs  1m43.9s/2m00.0s

running (1m44.9s), 0519/1000 VUs, 61322 complete and 0 interrupted iterations
load_test   [  87% ] 0519/1000 VUs  1m44.9s/2m00.0s

running (1m45.9s), 0486/1000 VUs, 61828 complete and 0 interrupted iterations
load_test   [  88% ] 0486/1000 VUs  1m45.9s/2m00.0s

running (1m46.9s), 0452/1000 VUs, 62282 complete and 0 interrupted iterations
load_test   [  89% ] 0452/1000 VUs  1m46.9s/2m00.0s

running (1m47.9s), 0420/1000 VUs, 62726 complete and 0 interrupted iterations
load_test   [  90% ] 0420/1000 VUs  1m47.9s/2m00.0s

running (1m48.9s), 0385/1000 VUs, 63129 complete and 0 interrupted iterations
load_test   [  91% ] 0385/1000 VUs  1m48.9s/2m00.0s

running (1m49.9s), 0353/1000 VUs, 63502 complete and 0 interrupted iterations
load_test   [  92% ] 0353/1000 VUs  1m49.9s/2m00.0s

running (1m50.9s), 0319/1000 VUs, 63853 complete and 0 interrupted iterations
load_test   [  92% ] 0319/1000 VUs  1m50.9s/2m00.0s

running (1m51.9s), 0289/1000 VUs, 64165 complete and 0 interrupted iterations
load_test   [  93% ] 0289/1000 VUs  1m51.9s/2m00.0s

running (1m52.9s), 0251/1000 VUs, 64449 complete and 0 interrupted iterations
load_test   [  94% ] 0251/1000 VUs  1m52.9s/2m00.0s

running (1m53.9s), 0219/1000 VUs, 64692 complete and 0 interrupted iterations
load_test   [  95% ] 0219/1000 VUs  1m53.9s/2m00.0s

running (1m54.9s), 0185/1000 VUs, 64904 complete and 0 interrupted iterations
load_test   [  96% ] 0185/1000 VUs  1m54.9s/2m00.0s

running (1m55.9s), 0154/1000 VUs, 65086 complete and 0 interrupted iterations
load_test   [  97% ] 0154/1000 VUs  1m55.9s/2m00.0s

running (1m56.9s), 0115/1000 VUs, 65237 complete and 0 interrupted iterations
load_test   [  97% ] 0115/1000 VUs  1m56.9s/2m00.0s

running (1m57.9s), 0086/1000 VUs, 65349 complete and 0 interrupted iterations
load_test   [  98% ] 0086/1000 VUs  1m57.9s/2m00.0s

running (1m58.9s), 0057/1000 VUs, 65434 complete and 0 interrupted iterations
load_test   [  99% ] 0057/1000 VUs  1m58.9s/2m00.0s

running (1m59.9s), 0021/1000 VUs, 65491 complete and 0 interrupted iterations
load_test   [ 100% ] 0021/1000 VUs  1m59.9s/2m00.0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<1000' p(95)=982.75ms
    ✗ 'p(99)<5000' p(99)=10.21s

    http_req_failed
    ✓ 'rate<0.01' rate=0.05%


  █ TOTAL RESULTS 

    checks_total.......: 131024 1084.17306/s
    checks_succeeded...: 97.58% 127863 out of 131024
    checks_failed......: 2.41%  3161 out of 131024

    ✗ status is 200
      ↳  99% — ✓ 65475 / ✗ 37
    ✗ response time < 1000ms
      ↳  95% — ✓ 62388 / ✗ 3124

    HTTP
    http_req_duration..............: avg=381.31ms min=5.93ms med=77.17ms max=1m0s   p(90)=625.41ms p(95)=982.75ms
      { expected_response:true }...: avg=363.03ms min=5.93ms med=77.01ms max=21.11s p(90)=623.59ms p(95)=978.41ms
    http_req_failed................: 0.05%  37 out of 65512
    http_reqs......................: 65512  542.08653/s

    EXECUTION
    iteration_duration.............: avg=1.38s    min=1s     med=1.07s   max=1m1s   p(90)=1.62s    p(95)=1.98s   
    iterations.....................: 65512  542.08653/s
    vus............................: 21     min=21          max=1000
    vus_max........................: 1000   min=1000        max=1000

    NETWORK
    data_received..................: 860 MB 7.1 MB/s
    data_sent......................: 7.5 MB 62 kB/s



running (2m00.9s), 0000/1000 VUs, 65512 complete and 0 interrupted iterations
load_test ✓ [ 100% ] 0000/1000 VUs  2m0s
time="2026-01-30T09:17:07+09:00" level=error msg="thresholds on metrics 'http_req_duration' have been crossed"